In [4]:
import pandas as pd

list_data = ['2019-01-02', '3.14', 'abc', 100, True]
sr = pd.Series(list_data)
print(sr)
print(type(sr))
print(sr.index)
print(sr.values)
print(type(sr.index))
print(type(sr.values))

0    2019-01-02
1          3.14
2           abc
3           100
4          True
dtype: object
<class 'pandas.core.series.Series'>
RangeIndex(start=0, stop=5, step=1)
['2019-01-02' '3.14' 'abc' 100 True]
<class 'pandas.core.indexes.range.RangeIndex'>
<class 'numpy.ndarray'>

In [20]:
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index = ['이름', '생년월일', '성별', '학생여부'])
print(sr)

print(sr[0])
print(sr['이름'])

print(sr[[1, 2]])
print(sr[['생년월일', '성별']])

print(sr[1:2])
print(sr['생년월일':'성별'])

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object
영인
영인
생년월일    2010-05-01
성별               여
dtype: object
생년월일    2010-05-01
성별               여
dtype: object
생년월일    2010-05-01
dtype: object
생년월일    2010-05-01
성별               여
dtype: object

In [21]:
dict_data = {'c0':[1, 2, 3], 'c1': [4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

print(type(df))
print('\n')
print(df)

<class 'pandas.core.frame.DataFrame'>


   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [8]:
exam_data = {'이름': ['서준', '우현', '인아'], '수학': [90, 80, 70], 
            '영어': [98, 89, 95], '음악': [85, 95, 100], '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)


df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [13]:
df.loc[3] = 0
df.loc[4] = ['동규', 90, 80, 70, 60]
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   영어      3 non-null      int64
 3   음악      3 non-null      int64
 4   체육      3 non-null      int64
 5   국어      3 non-null      int64
dtypes: int64(5), object(1)
memory usage: 272.0+ bytes

In [24]:
df['총점'] = df['수학'] + df['영어'] + df['음악'] + df['체육'] + df['국어']
df['평균'] = df['총점']/5
df

   이름  수학  영어   음악   체육   국어   총점    평균
0  서준  90  98   85  100   80  453  90.6
1  우현  80  89   95   90   70  424  84.8
2  인아  70  95  100   90  100  455  91.0

In [25]:
is_pass = []
for row in df['평균']:
    if(row >= 90):
        is_pass.append('합격')
    else:
        is_pass.append('불합격')
        
df['합불'] = is_pass
df

   이름  수학  영어   음악   체육   국어   총점    평균   합불
0  서준  90  98   85  100   80  453  90.6   합격
1  우현  80  89   95   90   70  424  84.8  불합격
2  인아  70  95  100   90  100  455  91.0   합격

In [26]:
def scholarship(row):
    if row == '합격':
        return '장학생'
    else:
        return '비장학생'

In [27]:
df['장학'] = df.합불.apply(scholarship)

In [29]:
df

   이름  수학  영어   음악   체육   국어   총점    평균   합불    장학
0  서준  90  98   85  100   80  453  90.6   합격   장학생
1  우현  80  89   95   90   70  424  84.8  불합격  비장학생
2  인아  70  95  100   90  100  455  91.0   합격   장학생

In [35]:
df.to_csv('test1.csv')

In [34]:
df.to_excel('test1.xlsx')